Revit 2026 API
Document.ActiveView Property
The document's active view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public View ActiveView { get; }
Public ReadOnly Property ActiveView As View
	Get
public:
property View^ ActiveView {
	View^ get ();
}
member ActiveView : View with get
Property Value
View
The active view is the view that last had focus in the UI. null if no view is considered active.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace